
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Склонения(Команда)
	// СтандартныеПодсистемы.СклонениеПредставленийОбъектов
	//ПараметрыСклонения = ПараметрыСклонения(ФизическоеЛицо);
	//СклонениеПредставленийОбъектовКлиент.ПоказатьСклонение(ЭтотОбъект, ФизическоеЛицо.Наименование, ПараметрыСклонения);
	// Конец СтандартныеПодсистемы.СклонениеПредставленийОбъектов
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
